updating stale md files
